app/Models/usuario_Model.php

	public function getUsuarios(){

		return $this->findAll();
---
SELECT *
FROM `usuarios`

	public function getUsuario($id){

		return $this->where('id_usuario', $id)->first($id);
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '7'
 LIMIT 1

	public function updateDatos($id, $datos){

		return $this->update($id, $datos);
---
UPDATE `usuarios` SET `nombre` = 'usuario 7', `apellido` = 'usuario', `email` = 'usuario@gmail.com', `usuario` = 'usuario', `pass` = '$2y$10$ub.YPNQEKeEYHkV3ZBap0evo6l5po.yh8PDeCdPKOuQwN.ShplE0m'
WHERE `usuarios`.`id_usuario` IN ('7')